// 1. Запитай у користувача радіус кола і виведи площу такої окружності.

const radius = +prompt('Який радіус кола?');
const areaOfCircle = (Math.PI * Math.pow(radius, 2));
alert('Площа кола: ' + areaOfCircle);



// 2. Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.

let distance = +prompt('Яка відстань між двома містами у кілометрах?');
let time = +prompt('За скільки годин ти хочеш подолати цю відстань щоб встигнути вчасно?');
const speed = (distance / time);
alert('Тобі потрібно їхати з швидкістю: ' + speed + 'км/год щоб встигнути вчасно')



// 3. Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.

const dollars = +prompt('Введіть суму в доларах:');
const exchangeRate = 0.85;
const euros = dollars * exchangeRate;
alert('Ви отримаєте ' + euros + ' євро за ' + dollars + ' доларів.');