// 1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

const add = (0.2+0.3);
alert(add);



// 2. Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

const add1 = +('1');
const add2 = (2);
alert(add1 + add2)



// 3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

const flashDrive = +prompt('Який обсяг флешки в ГБ?');
let conversion = (flashDrive * 1000);
const file = Math.floor(conversion / 820);
alert("На цб флешку можна записати " + file + "раз файлів які важать кожен по 820мб");

// Я хотів щоб в відповідь виводило тільки цілі числа тому я знайшов в інтереті такий метод як об'єкт Math.floor