// 1. Створи HTML-файл, в ньому пропиши всі можливі способи використання JS;

// В html



/* 2. Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен
змінних, що потрібні тобі для даної задачі. Також напиши до 5 неправильних імен
(неправильні імена повинні бути закоментовані); */

let firstName = 'John';
let lastName = 'Doe';
let age = 30;
const cityOfBirth = 'New York';

// Неправильне ім'я через пробіл
// let first name = 'Alice'; 

// Неправильне ім'я через початок з цифри
// let 2name = 'Bob'; 

// Неправильне ім'я через дефіс
// const last-name = 'Smith'; 

// Неправильне ім'я через відсутність змінної
// var = 'Michael'; 

// Неправильне ім'я через пробіли та дефіс
// const city of birth = 'London'; 



// 3. Вкажи всі можливі способи коментування коду;

// Це однорядковий коментар. Код після "//" не виконується.

/**
* Це коментар згортки.
* Використовується для документації коду.
* Наприклад, опис функцій, параметрів тощо.
*/

// Цей код не виконується:
// alert('Це повідомлення не відобразиться.');

/*
alert('Цей код не виконується:');
alert('Тому що він закоментований багаторядковим коментарем.');
*/



// 4. Які стилі написання імен змінних ти знаєш?

// camelCase
const camelCase

// PascalCase
const PascalCase

// snake_case
const snake_case