// 1. Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;

let userName = prompt('What your name?');
alert('Привіт,' + userName + '!');



// 2. Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;

let yearOfBirth = prompt('What is your year of birth?');
const nowYear = +(new Date().getFullYear());
const age = nowYear - yearOfBirth;
alert('Ваш вік: ' + age + ' років.');

/* У коді const nowYear = +(new Date().getFullYear());, new Date().getFullYear() використовується для отримання поточного року, ось так це працює:
1. 'new Date()' створює об'єкт типу 'Date', який представляє поточну дату та час.
2. 'new Date().getFullYear()' отримує поточний рік з цього об'єкта 'Date'.
2. '+' перед 'new Date().getFullYear()' використовується як унарний оператор для перетворення річного значення (яке є числом) на числовий тип даних. Відсутність знака '+' зробило б рік рядковим значенням.
Нарешті, 'const nowYear = +(new Date().getFullYear())' присвоює значення поточного року, отриманого за допомогою 'new Date().getFullYear()', змінній 'nowYear', після того як цей рік був перетворений на числовий тип даних.
Коротко кажучи, цей код дозволяє отримати поточний рік та зберегти його у змінній 'nowYear'. Завдяки використанню 'const', значення цієї змінної не може бути змінено пізніше в коді, тобто вона є сталою протягом життя програми. */



// 3. Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата

let squareSide = +prompt('Яка довжина однієї сторони квадрату?');
let squarePerimeter = (squareSide * 4);
alert('Периметр цього квадрата:' + squarePerimeter);