// 1. Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.

const depositAmount = +prompt('Введіть суму вкладу в банк:');
const monthlyInterestRate = 0.00416666666;
const months = 2;
const interestAmount = depositAmount * monthlyInterestRate * months;
alert(`Сума нарахованих відсотків за 2 місяці: ${interestAmount.toFixed(2)} грн.`);



// 2. Що повернуть вирази:

2 && 0 && 3 - відповідь false // якщо хоча б одне число буде неправильним false то й відповідь буде false, а 0 непрвильне тому загальна відповідь false

2 || 0 || 3 -  відповідь 2 // всі операнди читаються з ліва на право тому тому перше правильне значення(true) і буде виведене, а 2 є правильним значенням, тому відповіддю буде 2

2 && 0 || 3 - відповідь 3 // у виразі '2 && 0' обидва операнди повинні бути істинними (true), щоб результат був істинним. Однак, 0 вважається хибним значенням (false) в JavaScript. Таким чином, вираз 2 && 0 поверне 0 (хибне значення). А 3 є првильним значення(true) тому 3 правильна відповідь.